{
  "footer": {
    "projects": "Proyectos",
    "technologies": "Tecnolog칤as",
    "experience": "Experiencia",
    "contact": "Contacto"
  },
  "navbar": {
    "projects": "Proyectos",
    "technologies": "Tecnolog칤as",
    "experience": "Experiencia",
    "languageInput": {
      "options": {
        "en": "Ingl칠s",
        "es": "Espa침ol"
      }
    }
  },
  "404": {
    "title": "P치gina no encontrada",
    "description": "La p치gina o el proyecto que est치s buscando no existe!",
    "backToHome": "Volver a la p치gina de inicio"
  },
  "sections": {
    "aboutMe": {
      "containerId": "Sobre m칤",
      "title": "Sobre m칤",
      "whatsappText": "Hola! Me gustar칤a saber m치s sobre tus servicios! 游",
      "emailTextBody": "Hola! Me gustar칤a saber m치s sobre tus servicios! 游",
      "emailTextSubject": "Hola Cristi치n! 游",
      "descriptionTitle": "Soy Cristi치n, Desarrollador Full Stack",
      "description": "Soy un desarrollador Full Stack especializado en backend y con amplios conocimientos en JavaScript, ReactJS y ExpressJS. Destaco en programaci칩n avanzada, gesti칩n de bases de datos y dise침o de experiencia de usuario (UI/UX).",
      "contactMe": "Cont치ctame",
      "downloadCV": "Descargar CV",
      "downloadCVUrl": "https://github.com/cami98735264/cami98735264/raw/refs/heads/main/CRISTIAN%20CAMILO%20RODRIGUEZ%20FULL%20STACK%20CV%20ESPA칌OL.pdf"
    },
    "contactMe": {
      "containerId": "Cont치ctame",
      "title": "Cont치ctame",
      "description": "Si deseas contactarme para colaborar en un proyecto o simplemente saludar, no dudes en enviarme un mensaje a trav칠s de mi correo electr칩nico o mis redes sociales.",
      "form": {
        "name": "Sujeto",
        "email": "Correo electr칩nico",
        "message": "Mensaje",
        "send": "Enviar"
      }
    },
    "projects": {
      "viewProject": "Ver proyecto",
      "viewGithub": "Ver en GitHub",
      "viewOnline": "Ver en l칤nea",
      "projectsNotes": "Notas de proyecto y caracter칤sticas",
      "list": [
        {
          "id": 1,
          "title": "Plataforma de seguimiento y monitoreo de placas veh칤culares detectadas V2 (Mejorada y migrada a SvelteJS)",
          "onlineUrl": "https://rescep.com.co",
          "backgroundUrl": "https://iili.io/3fjWjPR.png",
          "screenshots":[
            "https://iili.io/3fO1bAF.png",
            "https://iili.io/3fO1D91.png",
            "https://iili.io/3fO1mwg.png",
            "https://iili.io/3fO1Z8P.png",
            "https://iili.io/3fOE2Fp.png",
            "https://iili.io/3fOEJPR.png",
            "https://iili.io/3fO1pta.png",
            "https://iili.io/3fOE9oJ.png",
            "https://iili.io/3fOEHMv.png",
            "https://iili.io/3fOEf9t.png",
            "https://iili.io/3fOEFSI.png",
            "https://iili.io/3fOEooG.png",
            "https://iili.io/3fOECts.png",
            "https://iili.io/3fOExVf.png",
            "https://iili.io/3fOETKl.png",
            "https://iili.io/3fOEul2.png",
            "https://iili.io/3fOEaDu.png",
            "https://iili.io/3fOEYNe.png",
            "https://iili.io/3fOE0Vj.png",
            "https://iili.io/3fOE1ix.png",
            "https://iili.io/3fOEMlV.png",
            "https://iili.io/3fOEGKQ.png",
            "https://iili.io/3fOEVUB.png",
            "https://iili.io/3fOEXHP.png",
            "https://iili.io/3fOEhR1.png"
          ],          
          "description": "Plataforma y software de detecci칩n de placas que utiliza el algoritmo de inteligencia artificial YoloV8 para el reconocimiento de matr칤culas. Implementaci칩n de funcionalidades para estudiar y mapear patrones de comportamiento basados en la ubicaci칩n de los registros de matr칤culas dentro de la plataforma web utilizando el framework SvelteJS",
          "projectNotes": [
            "Integraci칩n avanzada de IA: La migraci칩n a SvelteJS mejor칩 significativamente los indicadores de rendimiento con una reducci칩n del 40% en los tiempos de carga en comparaci칩n con la versi칩n original. El algoritmo YoloV8 logra m치s del 95% de precisi칩n en la detecci칩n de placas bajo diversas condiciones de iluminaci칩n y 치ngulos.",
            "An치lisis de patrones de comportamiento: La plataforma incorpora herramientas sofisticadas de visualizaci칩n de datos que transforman los registros de placas en inteligencia procesable. Los usuarios pueden identificar patrones de tr치fico, visitantes recurrentes y comportamientos an칩malos de veh칤culos a trav칠s de mapas de calor intuitivos y vistas de l칤nea de tiempo.",
            "Arquitectura escalable: La arquitectura del sistema redise침ada permite el procesamiento distribuido de flujos de video, lo que habilita la supervisi칩n en tiempo real en m칰ltiples ubicaciones simult치neamente sin degradaci칩n del rendimiento. El esquema de la base de datos MySQL fue optimizado para consultas r치pidas de datos hist칩ricos de placas."
          ],          
          "technologies": [
            {
              "name": "SvelteJS",
              "backgroundColor": "#FF3E00",
              "textColor": "#FFFFFF"
            },
            {
              "name": "NodeJS",
              "backgroundColor": "#68A063",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            }
          ]
        },
        {
          "id": 2,
          "title": "Software de detecci칩n de placas veh칤culares YoloV8",
          "description": "Desarrollo de software de reconocimiento de matr칤culas utilizando el algoritmo de inteligencia artificial YoloV8.",
          "backgroundUrl": "https://iili.io/3fjWjPR.png",
          "projectNotes": [
            "Entrenamiento de modelo personalizado: El modelo YoloV8 fue ajustado finamente con un conjunto de datos de m치s de 10,000 placas colombianas, teniendo en cuenta variaciones regionales y deterioro. Este entrenamiento especializado result칩 en un aumento del 30% en las tasas de reconocimiento en comparaci칩n con modelos gen칠ricos.",
            "Procesamiento en tiempo real: El software procesa flujos de video a 20-30 cuadros por segundo en hardware est치ndar, con un muestreo inteligente de cuadros para equilibrar precisi칩n y rendimiento. Un sistema de almacenamiento en b칰fer garantiza que no se pierdan placas durante picos de procesamiento.",
            "Mejora en el reconocimiento de caracteres: Algoritmos avanzados de postprocesamiento corrigen errores comunes de OCR espec칤ficos de las fuentes de placas, mejorando la precisi칩n del reconocimiento de caracteres del 85% al 98%. El sistema puede distinguir entre caracteres similares (por ejemplo, 8/B, 0/O) con alta confianza."
          ],
          "screenshots": [
            "https://iili.io/33gNYcN.png",
            "https://iili.io/33gN0AX.png",
            "https://iili.io/33gN7Fp.png",
            "https://iili.io/33gNl9t.png",
            "https://iili.io/33gNEts.png",
            "https://iili.io/33gN1Nn.png",
            "https://iili.io/33gNVVf.jpg",
            "https://iili.io/33gNWP4.jpg"
          ],
          "technologies": [
            {
              "name": "Python",
              "backgroundColor": "#3776AB",
              "textColor": "#FFFFFF"
            },
            {
              "name": "OpenCV",
              "backgroundColor": "#5C3EE8",
              "textColor": "#FFFFFF"
            },
            {
              "name": "YoloV8",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            },
            {
              "name": "TensorFlow",
              "backgroundColor": "#FF6F00",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "Flask",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            }
          ]
        },
        {
          "id": 3,
          "title": "Plataforma deportiva para gesti칩n de torneos",
          "description": "Desarrollo de una plataforma full-stack con gesti칩n de roles, enrutamiento y autenticaci칩n en ReactJS y ExpressJS para gestionar cada fase de los torneos deportivos, utilizando validaciones avanzadas y din치micas con la biblioteca express-validator.",
          "backgroundUrl": "https://iili.io/3fjmHuI.png",
          "projectNotes": [
            "Configuraci칩n din치mica de torneos: La plataforma admite m칰ltiples estructuras de torneo (eliminaci칩n directa, todos contra todos, fases de grupos) con generaci칩n autom치tica de horarios y resoluci칩n de conflictos. El sistema distribuye inteligentemente los partidos en los recintos y franjas horarias disponibles.",
            "Sistema de puntuaci칩n en tiempo real: Los 치rbitros pueden actualizar los puntajes en tiempo real, lo que desencadena actualizaciones autom치ticas del cuadro de torneo, notificaciones y rec치lculo de estad칤sticas. Un sistema de doble verificaci칩n previene errores de puntuaci칩n en partidos de alta importancia.",
            "An치lisis integral: Los equipos y administradores tienen acceso a m칠tricas de rendimiento detalladas, incluyendo enfrentamientos hist칩ricos, estad칤sticas de jugadores y an치lisis predictivos basados en el desempe침o pasado. Se pueden generar informes personalizados para distintos interesados con diversas opciones de visualizaci칩n de datos."
          ],
          "screenshots": [
            "https://iili.io/33rFs2a.png",
            "https://iili.io/33rFQkv.png",
            "https://iili.io/33rFLYJ.png",
            "https://iili.io/33rFPrg.png",
            "https://iili.io/33rFbhN.png",
            "https://iili.io/33rFyBt.png",
            "https://iili.io/33rK9EX.png",
            "https://iili.io/33rKH4n.png",
            "https://iili.io/33rK2YG.png",
            "https://iili.io/33rKFp4.png",
            "https://iili.io/33rKqj2.png",
            "https://iili.io/33rKBQS.png",
            "https://iili.io/33rKx4e.png",
            "https://iili.io/33rKTYb.png",
            "https://iili.io/33rKI3u.png",
            "https://iili.io/33rKuvj.png",
            "https://iili.io/33rK7jV.png",
            "https://iili.io/33rKYZB.png",
            "https://iili.io/33rKlG1.png",
            "https://iili.io/33rK06F.png",
            "https://iili.io/33rKE3g.png",
            "https://iili.io/33rKM8J.png"
          ],
          "technologies": [
            {
              "name": "ExpressJS",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            },
            {
              "name": "NodeJS",
              "backgroundColor": "#68A063",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            }
          ]
        },
        {
          "id": 4,
          "title": "Traductor de lenguaje natural a lenguaje de se침as (interprete virtual)",
          "description": "Desarrollo de una API en ExpressJS para interpretar el lenguaje de se침as colombiano basada en inteligencia artificial utilizando GPT-4 y la API de OpenAI.",
          "backgroundUrl": "https://iili.io/3fw2dJa.png",
          "projectNotes": [
            "Traducci칩n con conciencia del contexto: El sistema no solo traduce palabras individualmente, sino que analiza oraciones completas para mantener una estructura gramatical adecuada en lengua de se침as. Maneja expresiones idiom치ticas traduciendo el significado subyacente en lugar de las palabras literales.",
            "Sistema de avatar personalizable: El avatar int칠rprete se puede personalizar en g칠nero, edad y apariencia para crear una experiencia m치s c칩moda y personalizada para los usuarios. Se ofrecen diferentes velocidades de se침as para adaptarse tanto a principiantes como a usuarios fluidos.",
            "Modo educativo: M치s all치 de la traducci칩n, el sistema incluye un componente educativo que explica las elecciones de se침as y proporciona se침as alternativas para ciertos conceptos. Esta funci칩n ayuda a los usuarios a aprender lengua de se침as mientras usan la herramienta de traducci칩n."
          ],
          "screenshots": ["https://iili.io/33rxcOu.gif"],
          "technologies": [
            {
              "name": "ExpressJS",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            },
            {
              "name": "NodeJS",
              "backgroundColor": "#68A063",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            },
            {
              "name": "NextJS",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            }
          ]
        },
        {
          "id": 5,
          "title": "Sistema para seguimiento de egresados",
          "description": "Este software permite a los egresados enviar su educaci칩n y trabajos despu칠s de graduarse para que la universidad pueda realizar un seguimiento de las estad칤sticas. Desarroll칠 las vistas de la aplicaci칩n en ReactJS, incluyendo tanto la p치gina de inicio como el sistema de panel de control. Dise침칠 la UI/UX utilizando la biblioteca de componentes DaisyUI para asegurar la consistencia visual en todo el producto. En el backend, utilizando ExpressJS, inclu칤 sistemas de autenticaci칩n segura y gesti칩n de sesiones. Adem치s, integr칠 una API p칰blica externa de datos (universidades en el pa칤s) para capturar din치micamente la respuesta del usuario desde los inputs.",
          "githubUrl": {
            "frontend": "https://github.com/cami98735264/egresados-iesi",
            "backend": "https://github.com/cami98735264/egresados-sanisidoro-backend"
          },
          "backgroundUrl": "https://iili.io/3fOTMcG.png",
          "projectNotes": [
            "Visualizaci칩n de trayectoria profesional: El sistema genera representaciones visuales de las trayectorias laborales de los exalumnos, identificando transiciones comunes de industria y patrones de avance. Esto proporciona informaci칩n valiosa para los estudiantes actuales en la planificaci칩n de su educaci칩n y carrera.",
            "Facilitaci칩n de networking: La plataforma incluye funciones para conectar a exalumnos que trabajan en campos o regiones similares, creando una red profesional valiosa. Los controles de privacidad permiten a los usuarios determinar qu칠 informaci칩n es visible para otros exalumnos.",
            "Retroalimentaci칩n curricular basada en datos: El an치lisis de los resultados laborales de los exalumnos informa directamente el desarrollo curricular, destacando brechas de habilidades y requisitos emergentes de la industria. Los directores de departamento reciben informes peri칩dicos sobre m칠tricas de 칠xito de los exalumnos relevantes para sus programas."
          ],
          "screenshots": [
            "https://iili.io/33gpqhu.png",
            "https://iili.io/33gp3k7.png",
            "https://iili.io/33gpFp9.png",
            "https://iili.io/33gpd22.png",
            "https://iili.io/33gpfIe.png",
            "https://iili.io/33gpBLb.png",
            "https://iili.io/33gpnBj.png",
            "https://iili.io/33gpoEx.png",
            "https://iili.io/33gpI2V.png",
            "https://iili.io/33gpukP.png",
            "https://iili.io/33gpTYB.png",
            "https://iili.io/33gpAp1.png",
            "https://iili.io/33gp5TF.png",
            "https://iili.io/33gp7hg.png",
            "https://iili.io/33gpcCJ.png",
            "https://iili.io/33gpYQa.png"
          ],
          "technologies": [
            {
              "name": "ExpressJS",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            },
            {
              "name": "NodeJS",
              "backgroundColor": "#68A063",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            },
            {
              "name": "ReactJS",
              "backgroundColor": "#61DAFB",
              "textColor": "#000000"
            }
          ]
        },
        {
          "id": 6,
          "title": "Sistema de veterinaria",
          "description": "Dise침칠 y desarroll칠 el m칩dulo de registro e inicio de sesi칩n, incluyendo la creaci칩n de la UI/UX de la aplicaci칩n. Implement칠 un sistema CRUD para gestionar las citas de mascotas, integrando datos din치micos de la base de datos como el tipo de animal y el tipo de consulta (cirug칤a, revisi칩n, accidente, etc.). El sistema fue configurado para incluir los precios de las consultas y mostrar los datos relevantes en la pantalla. Se integraron funcionalidades avanzadas para mejorar la gesti칩n y presentaci칩n de informaci칩n crucial para la pr치ctica veterinaria.",
          "backgroundUrl": "https://iili.io/3fwhBHB.png",
          "githubUrl": {
            "frontend": "https://github.com/cami98735264/veterinaria-crud-sessions",
            "backend": "https://github.com/cami98735264/veterinaria-crud-sessions-backend"
          },
          "projectNotes": [
            "Gesti칩n de protocolos de tratamiento: Los veterinarios pueden acceder y actualizar protocolos de tratamiento estandarizados para condiciones comunes, garantizando coherencia entre los profesionales. El sistema rastrea la adherencia a los protocolos y los resultados para mejorar la atenci칩n veterinaria."
          ],
          "screenshots": [
            "https://iili.io/33rCQzx.png",
            "https://iili.io/33rCsbj.png",
            "https://iili.io/33rCZWQ.png",
            "https://iili.io/33rCP5u.png",
            "https://iili.io/33rCm0P.png",
            "https://iili.io/33rCpg1.png",
            "https://iili.io/33rnJea.png",
            "https://iili.io/33rndmJ.png",
            "https://iili.io/33rnqqN.png",
            "https://iili.io/33rnB1I.png",
            "https://iili.io/33rnCgt.png",
            "https://iili.io/33rnodX.png",
            "https://iili.io/33rnzes.png"
          ],
          "technologies": [
            {
              "name": "ExpressJS",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            },
            {
              "name": "NodeJS",
              "backgroundColor": "#68A063",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            },
            {
              "name": "ReactJS",
              "backgroundColor": "#61DAFB",
              "textColor": "#000000"
            }
          ]
        },
        {
          "id": 7,
          "title": "Autenticaci칩n avanzada para una plataforma de sensores",
          "description": "Durante el desarrollo del sistema de sensores, cre칠 un sistema de inicio de sesi칩n y registro completo utilizando ExpressJS y autenticaci칩n por correo electr칩nico. Esto incluy칩 implementar la funcionalidad para enviar c칩digos de inicio de sesi칩n por correo electr칩nico utilizando credenciales temporales de aplicaciones de Google y la biblioteca Nodemailer. En el frontend, construido con ReactJS y DaisyUI, estos c칩digos de inicio de sesi칩n din치micos se enviaron a los usuarios por correo electr칩nico e integraron sin problemas en el formulario de inicio de sesi칩n, asegurando un proceso de autenticaci칩n fluido y seguro.",
          "backgroundUrl": "https://iili.io/33rdx5l.png",
          "githubUrl": {
            "frontend": "https://github.com/cami98735264/sensores-auth-system-router",
            "backend": "https://github.com/cami98735264/sensores-auth-system-router-backend"
          },
          "projectNotes": [
            "Arquitectura de seguridad multifactor: El sistema de autenticaci칩n por correo electr칩nico implementa tokens sensibles al tiempo con verificaci칩n del lado del servidor, lo que lo hace resistente a ataques de autenticaci칩n comunes. Los intentos fallidos de autenticaci칩n activan medidas de seguridad progresivas."
          ],
          "screenshots": [
            "https://iili.io/33rdx5l.png",
            "https://iili.io/33rdoJ4.png",
            "https://iili.io/33rdze2.png",
            "https://iili.io/33rdCgf.png",
            "https://iili.io/33rdIbS.png",
            "https://iili.io/33rduz7.png",
            "https://iili.io/33rdAX9.png",
            "https://iili.io/33rdRse.png",
            "https://iili.io/33rd7qu.png",
            "https://iili.io/33rdY0b.png"
          ],
          "technologies": [
            {
              "name": "ExpressJS",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            },
            {
              "name": "NodeJS",
              "backgroundColor": "#68A063",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            },
            {
              "name": "ReactJS",
              "backgroundColor": "#61DAFB",
              "textColor": "#000000"
            }
          ]
        },
        {
          "id": 8,
          "title": "Plataforma de seguimiento y monitoreo de placas veh칤culares detectadas (versi칩n antigua)",
          "description": "Plataforma y software de detecci칩n de placas que utiliza el algoritmo de inteligencia artificial YoloV8 para el reconocimiento de matr칤culas. Implementaci칩n de funcionalidades para estudiar y mapear patrones de comportamiento basados en la ubicaci칩n de los registros de matr칤culas dentro de la plataforma web alojada en archivos est치ticos usando ExpressJS.",
          "githubUrl": {
            "frontend": "https://github.com/cami98735264/graphical-interface-monitoreo-placas",
            "backend": "https://github.com/cami98735264/graphical-interface-monitoreo-placas"
          },
          "backgroundUrl": "https://iili.io/3fjWjPR.png",
          "projectNotes": [
            "Fundaci칩n para la evoluci칩n: Esta versi칩n inicial estableci칩 los modelos de datos fundamentales y los flujos de procesamiento que permitieron la plataforma m치s sofisticada de la versi칩n 2. La arquitectura fue dise침ada con la escalabilidad futura en mente, facilitando la posterior migraci칩n a SvelteJS."
          ],
          "screenshots": [
            "https://iili.io/33gZNwb.png",
            "https://iili.io/33gZWc7.png",
            "https://iili.io/33gZOtj.png",
            "https://iili.io/33gZvMQ.png",
            "https://iili.io/33gZ8PV.png",
            "https://iili.io/33gZUKB.png",
            "https://iili.io/33gZgcP.png",
            "https://iili.io/33gZrS1.png",
            "https://iili.io/33gZ6HF.png",
            "https://iili.io/33gZiNa.png",
            "https://iili.io/33gZbKN.png",
            "https://iili.io/33gZZVR.png",
            "https://iili.io/33gZmlI.jpg"
          ],
          "technologies": [
            {
              "name": "ExpressJS",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            },
            {
              "name": "NodeJS",
              "backgroundColor": "#68A063",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            }
          ]
        },
        {
          "id": 9,
          "title": "Portafolio V1",
          "description": "Desarrollo y primer dise침o de mi primer portafolio personal utilizando Astro para mostrar mis proyectos y tecnolog칤as.",
          "backgroundUrl": "https://iili.io/3fNkiu4.png",
          "screenshots": [
            "https://iili.io/3fNkiu4.png",
            "https://iili.io/3fNk48G.png",
            "https://iili.io/3fNkP9f.png",
            "https://iili.io/3fNkras.png",
            "https://iili.io/3fNkswl.png"
          ],
          "onlineUrl": "https://cami98735264.netlify.app/",
          "githubUrl": {
            "frontend": "https://github.com/cami98735264/portfolio-website"
          },
          "projectNotes": [
            "Enfoque en el rendimiento: La primera iteraci칩n del portafolio prioriz칩 la velocidad de carga y la accesibilidad, logrando una puntuaci칩n perfecta de 100 en rendimiento seg칰n Lighthouse. La generaci칩n est치tica con Astro elimin칩 la sobrecarga de JavaScript en tiempo de ejecuci칩n mientras manten칤a componentes interactivos.",
            "Desarrollo de estrategia de contenido: Esta versi칩n estableci칩 la arquitectura de contenido inicial que evolucionar칤a en iteraciones posteriores. El sistema de categorizaci칩n de proyectos introducido aqu칤 demostr칩 ser efectivo y se ampli칩 en versiones subsiguientes."
          ],
          "technologies": [
            {
              "name": "Astro",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            }
          ]
        },
        {
          "id": 10,
          "title": "Portafolio V2",
          "description": "Desarrollo y segundo dise침o de mi portafolio personal utilizando Astro para mostrar mis proyectos y tecnolog칤as.",
          "backgroundUrl": "https://iili.io/3fNDFx1.png",
          "screenshots": [
            "https://iili.io/3fNDFx1.png",
            "https://iili.io/3fNDdOB.png",
            "https://iili.io/3fND2DP.png",
            "https://iili.io/3fNDJRV.png",
            "https://iili.io/3fNDKWF.png",
            "https://iili.io/3fNDBfa.png",
            "https://iili.io/3fNDxJR.png",
            "https://iili.io/3fNDzRp.png"
          ],          
          "projectNotes": [
            "Soporte multiling칲e: Esta versi칩n introdujo un sistema integral de internacionalizaci칩n que admite m칰ltiples idiomas con cambio de idioma basado en URL. Las traducciones de contenido se gestionaron a trav칠s de archivos JSON estructurados para facilitar su mantenimiento.",
            "Exhibici칩n mejorada de proyectos: El sistema de visualizaci칩n de proyectos fue redise침ado para resaltar de manera m치s efectiva los detalles t칠cnicos y los elementos visuales. Los componentes interactivos permitieron a los visitantes explorar los proyectos en mayor profundidad sin salir de la p치gina."
          ],
          "onlineUrl": "https://new-design--cristackdesign.netlify.app/es/",
          "githubUrl": {
            "frontend": "https://github.com/cami98735264/portfolio-website/tree/new_design"
          },
          "technologies": [
            {
              "name": "Astro",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            }
          ]
        },
        {
          "id": 11,
          "title": "Portafolio V3",
          "description": "Desarrollo y tercer dise침o de mi portafolio personal utilizando Astro para mostrar mis proyectos y tecnolog칤as.",
          "backgroundUrl": "https://iili.io/3fOqaHP.png",
          "onlineUrl": "https://crodriguez.com.co",
          "githubUrl": {
            "frontend": "https://github.com/cami98735264/portfolio-v3"
          },
          "screenshots": [
            "https://iili.io/3fOqaHP.png",
            "https://iili.io/3fOq5lV.png",
            "https://iili.io/3fOq7UB.png",
            "https://iili.io/3fOqRKQ.png",
            "https://iili.io/3fOqcR1.png",
            "https://iili.io/3fOq0Dg.png",
            "https://iili.io/3fOqGWJ.png",
            "https://iili.io/3fOqExa.png",
            "https://iili.io/3fOqWfR.png",
            "https://iili.io/3fOqXlp.png",
            "https://iili.io/3fOqhUN.png",
            "https://iili.io/3fOqwJI.png",
            "https://iili.io/3fOqNRt.png",
            "https://iili.io/3fOqOOX.png"
          ],          
          "projectNotes": [
            "Entrega de contenido optimizada: La 칰ltima versi칩n del portafolio implementa t칠cnicas avanzadas de carga diferida y mejora progresiva, logrando tiempos de carga percibidos casi instant치neos a pesar de un contenido m치s rico. Se identificaron y priorizaron las rutas cr칤ticas."
          ],
          "technologies": [
            {
              "name": "Astro",
              "backgroundColor": "#000000",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            }
          ]
        }
      ],
      "containerId": "Proyectos",
      "count": {
        "description": "hasta la fecha"
      },
      "title": "Lista de proyectos",
      "description": "En esta secci칩n, se recopilar치n cada uno de mis proyectos que me han definido un aprendizaje crucial en el proceso y creaci칩n de cada uno de ellos."
    },
    "technologies": {
      "containerId": "Tecnolog칤as",
      "count": {
        "description": "hasta la fecha"
      },
      "categories": {
        "frontend": "Desarrollo Frontend",
        "backend": "Desarrollo Backend",
        "databases": "Bases de datos",
        "designTools": "Herramientas de dise침o",
        "deployment": "Despliegue"
      },
      "title": "Lista de tecnolog칤as",
      "description": "En esta secci칩n, se recopilar치n las tecnolog칤as que he utillizado en mi trayector칤a y de las cuales tengo un grado de proficiencia para cada una de ellas."
    },
    "experience": {
      "experienceList": [
        {
          "company": "PayBluem",
          "position": "Desarrollador Full Stack",
          "startDate": "Mayo 2024",
          "endDate": "Diciembre 2024",
          "description": "Una plataforma deportiva desarrollada en ReactJS y ExpressJS, que ofrece una soluci칩n integral para torneos deportivos.",
          "tasksList": [
            "Desarrollo de una plataforma full-stack con gesti칩n de roles, enrutamiento y autenticaci칩n en ReactJS y ExpressJS.",
            "Dise침o del flujo de registro y pago para torneos, permitiendo a los l칤deres de equipo registrar y organizar eventos.",
            "Desarrollo de m칩dulos para la creaci칩n y gesti칩n de fases de grupos y eliminatorias, incluyendo la generaci칩n de cuadros de torneos.",
            "Implementaci칩n de diagramas din치micos de cuadros de torneos para visualizar fases y resultados de partidos."
          ],
          "technologiesList": [
            {
              "name": "ExpressJS",
              "backgroundColor": "#2C2C2C",
              "textColor": "#FFFFFF"
            },
            {
              "name": "NodeJS",
              "backgroundColor": "#6BBF47",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            },
            {
              "name": "ReactJS",
              "backgroundColor": "#61DAFB",
              "textColor": "#000000"
            }
          ]
        },
        {
          "company": "PayBluem",
          "position": "Desarrollador Full Stack",
          "startDate": "Enero 2024",
          "endDate": "Abril 2024",
          "description": "Plataforma y software para el reconocimiento de matr칤culas de veh칤culos utilizando inteligencia artificial.",
          "tasksList": [
            "Desarrollo de software para el reconocimiento de matr칤culas utilizando el algoritmo de IA YoloV8.",
            "Implementaci칩n de funcionalidades para estudiar y mapear patrones de comportamiento basados en la ubicaci칩n de los registros de matr칤culas dentro de la plataforma web, alojada como archivos est치ticos utilizando ExpressJS."
          ],
          "technologiesList": [
            {
              "name": "YoloV8",
              "backgroundColor": "#2C2C2C",
              "textColor": "#FFFFFF"
            },
            {
              "name": "Python",
              "backgroundColor": "#3776AB",
              "textColor": "#FFFFFF"
            },
            {
              "name": "OpenCV",
              "backgroundColor": "#5C3EE8",
              "textColor": "#FFFFFF"
            },
            {
              "name": "TensorFlow",
              "backgroundColor": "#FF6F00",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "Flask",
              "backgroundColor": "#2C2C2C",
              "textColor": "#FFFFFF"
            },
            {
              "name": "Ultralytics",
              "backgroundColor": "#2C2C2C",
              "textColor": "#FFFFFF"
            }
          ]
        },
        {
          "company": "PayBluem",
          "position": "Desarrollador Full Stack",
          "startDate": "Julio 2023",
          "endDate": "Diciembre 2023",
          "description": "Plataforma para la interpretaci칩n de Lengua de Se침as Colombiana utilizando inteligencia artificial con GPT-4 y la API de OpenAI.",
          "tasksList": [
            "Desarrollo de una API en ExpressJS para interpretar la Lengua de Se침as Colombiana basada en IA utilizando GPT-4 y la API de OpenAI.",
            "Implementaci칩n de un sistema para traducir texto en lenguaje natural a Lengua de Se침as Colombiana, mostrado por un int칠rprete en una pantalla verde dentro de una plataforma web construida en NextJS.",
            "Desarrollo y optimizaci칩n de algoritmos para el procesamiento de lenguaje natural y reconocimiento de se침as para asegurar una traducci칩n precisa y fluida."
          ],
          "technologiesList": [
            {
              "name": "ExpressJS",
              "backgroundColor": "#2C2C2C",
              "textColor": "#FFFFFF"
            },
            {
              "name": "NodeJS",
              "backgroundColor": "#6BBF47",
              "textColor": "#FFFFFF"
            },
            {
              "name": "MySQL",
              "backgroundColor": "#F29111",
              "textColor": "#FFFFFF"
            },
            {
              "name": "JavaScript",
              "backgroundColor": "#F0DB4F",
              "textColor": "#000000"
            },
            {
              "name": "NextJS",
              "backgroundColor": "#2C2C2C",
              "textColor": "#FFFFFF"
            }
          ]
        }
      ],
      "containerId": "Experiencia",
      "title": "Experiencia laboral",
      "description": "Con una trayectoria de +1 a침o de experiencia, he dise침ado sistemas de informaci칩n en diferentes 치mbitos empresariales, certificando mi conocimiento en creaci칩n y despliegue de aplicaciones full stack."
    }
  }
}
